# yolov8n_custom_v1.yaml
nc: 1 
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0 (320x320)
  - [-1, 1, Conv, [128, 3, 2]] # 1 (160x160)
  - [-1, 3, C2f, [128, True]]  # 2 (160x160)
  - [-1, 1, Conv, [256, 3, 2]] # 3 (80x80) - P3
  - [-1, 6, C2f, [256, True]]  # 4 (80x80)
  - [-1, 1, Conv, [512, 3, 2]] # 5 (40x40) - P4
  - [-1, 6, C2f, [512, True]]  # 6 (40x40)
  - [-1, 1, Conv, [1024, 3, 2]] # 7 (20x20) - P5
  - [-1, 3, C2f, [1024, True]] # 8 (20x20)
  - [-1, 1, SPPF, [1024, 5]]   # 9 (20x20)

head:
  # 1. Работаем с мелким масштабом (P3)
  - [-1, 1, nn.Upsample, [None, 4, "nearest"]] # 10: 20x20 -> 80x80
  - [[-1, 4], 1, Concat, [1]]                  # 11: Склеиваем 80x80 (из 10) и 80x80 (из 4)
  - [-1, 3, C2f, [256]]                        # 12 (Выход 1: мелкие объекты)

  # 2. Возвращаемся к крупному масштабу (P5)
  - [-1, 1, Conv, [256, 3, 2]]                 # 13: Уменьшаем 80x80 обратно до 40x40 (stride 2)
  - [-1, 1, Conv, [512, 3, 2]]                 # 14  уменьшили до 20х20
  - [[-1, 9], 1, Concat, [1]]                  # 15: Склеиваем 20x20 (из 13) и 20x20 (из 9)
  - [-1, 3, C2f, [1024]]                       # 16 (Выход 2: крупные объекты)

  # 3. Детектор
  - [[12, 16], 1, Detect, [nc]]                # 17: Детекция на двух уровнях
