# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 129 layers, 3157200 parameters, 3157184 gradients, 8.9 GFLOPS

# YOLOv8.0n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0 (320x320)
  - [-1, 1, Conv, [128, 3, 2]] # 1 (160x160)
  - [-1, 3, C2f, [128, True]]  # 2 (160x160)
  - [-1, 1, Conv, [256, 3, 2]] # 3 (80x80) - P3
  - [-1, 6, C2f, [256, True]]  # 4 (80x80)
  # - [-1, 1, Conv, [512, 3, 2]] # 5 (40x40) - P4
  # - [-1, 6, C2f, [512, True]]  # 6 (40x40)
  - [-1, 1, Conv, [1024, 3, 2]] # 7 (20x20) - P5
  - [-1, 3, C2f, [1024, True]] # 8 (20x20)
  - [-1, 1, SPPF, [1024, 5]]   # 9 (20x20) стало 40х40

# YOLOv8.0n head
head:
  # - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  # - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  # - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # стало 40х40
  # - [[-1, 12], 1, Concat, [1]] # cat head P4
  # - [-1, 3, C2f, [512]] # 18 (P4/16-medium)

  # - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 7], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 21 (P5/32-large)

  - [[10, 13], 1, Detect, [nc]] # Detect(P3, P4, P5)